/*
设直线方程：y=kx+t…………………………………………………………（1）
  抛物线方程：y=ax^2+bx+c……………………………………………………（2）
已知抛物线顶点p1（x1，y1），两线交点p2（x2，y2）和p3（x3，y3）
斜率k=(y3-y2)/(x3-x2)……………………………………………………（3）
把p3点代入（1）式结合（3）式可得：t=y3-(k*x3)
又因为p1是抛物线的顶点，可得关系：x1=-b/2a即b=-2a*x1………………（4）
把p1点代入（2）式结合（4）式可得：a*x1*x1-2a*x1*x1+c=y1化简得c=y1+a*x1*x1……（5）
把p2点代入（2）式结合（4）式和（5）式可得：a=(y2-y1)/((x1-x2)*(x1-x2))
于是通过3点求出了k，t，a，b，c即两个方程式已求出
题目时求面积s
通过积分可知：s=f（x2->x3）(积分符号)（ax^2+bx+c-（kx+t））
               =f（x2->x3）(积分符号)（ax^2+（b-k）x+c-t）
               =[a/3*x^3+(b-k)/2*x^2+(c-t)x](x2->x3)
               =a/3*x3*x3*x3+(b-k)/2*x3*x3+(c-t)*x3-(a/3*x2*x2*x2+(b-k)/2*x2*x2+(c-t)*x2)
化简得：
面积公式：s=-(y2-y1)/（(x2-x1)*(x2-x1)）*（(x3-x2)*(x3-x2)*(x3-x2)）/6;
*/
//详情请看我的GitHub 
#include<stdio.h>
int main()
{
	int T;
	double x1,y1,x2,y2,x3,y3,s;
	scanf("%d",&T);
	while(T--)
	{
		scanf("%lf %lf %lf %lf %lf %lf",&x1,&y1,&x2,&y2,&x3,&y3);
		s=-(y2-y1)/((x2-x1)*(x2-x1))*((x3-x2)*(x3-x2)*(x3-x2))/6;
		printf("%.2lf\n",s);
	}
	return 0;
} 